In [1]:
import pandas as pd

In [2]:
dd={'oop':{'3rd':22},'java':{'5th':60},"Ds":{'6th':51}}

In [4]:
df2=pd.DataFrame(dd)

In [5]:
df2

       Ds  java   oop
3rd   NaN   NaN  22.0
5th   NaN  60.0   NaN
6th  51.0   NaN   NaN

In [20]:
df2.append({"cpp":70},ignore_index=True)

     Ds  java   oop   cpp
0   NaN   NaN  22.0   NaN
1   NaN  60.0   NaN   NaN
2  51.0   NaN   NaN   NaN
3   NaN   NaN   NaN  70.0

In [33]:
print(df2)

       Ds  java   oop
3rd   NaN   NaN  22.0
5th   NaN  60.0   NaN
6th  51.0   NaN   NaN

In [38]:
df2.drop(['6th'],axis=0)

     Ds  java   oop
3rd NaN   NaN  22.0
5th NaN  60.0   NaN